## Project 2 - ETL

### Import Dependencies

In [1]:
import pandas as pd
from sqlalchemy import create_engine
from sqlalchemy import inspect

### Extract CSVs into DataFrames

In [2]:
application_record_file = "Resources/application_record.csv"
application_record_df = pd.read_csv(application_record_file)
application_record_df.head()

,ID,CODE_GENDER,FLAG_OWN_CAR,FLAG_OWN_REALTY,CNT_CHILDREN,AMT_INCOME_TOTAL,NAME_INCOME_TYPE,NAME_EDUCATION_TYPE,NAME_FAMILY_STATUS,NAME_HOUSING_TYPE,DAYS_BIRTH,DAYS_EMPLOYED,FLAG_MOBIL,FLAG_WORK_PHONE,FLAG_PHONE,FLAG_EMAIL,OCCUPATION_TYPE,CNT_FAM_MEMBERS
0,5008804,M,Y,Y,0,427500.0,Working,Higher education,Civil marriage,Rented apartment,-12005,-4542,1,1,0,0,NaN,2.0
1,5008805,M,Y,Y,0,427500.0,Working,Higher education,Civil marriage,Rented apartment,-12005,-4542,1,1,0,0,NaN,2.0
2,5008806,M,Y,Y,0,112500.0,Working,Secondary / secondary special,Married,House / apartment,-21474,-1134,1,0,0,0,Security staff,2.0
3,5008808,F,N,Y,0,270000.0,Commercial associate,Secondary / secondary special,Single / not married,House / apartment,-19110,-3051,1,0,1,1,Sales staff,1.0
4,5008809,F,N,Y,0,270000.0,Commercial associate,Secondary / secondary special,Single / not married,House / apartment,-19110,-3051,1,0,1,1,Sales staff,1.0

In [3]:
credit_record_file = "Resources/credit_record.csv"
credit_record_df = pd.read_csv(credit_record_file)
credit_record_df.head()

        ID  MONTHS_BALANCE STATUS
0  5001711               0      X
1  5001711              -1      0
2  5001711              -2      0
3  5001711              -3      0
4  5001712               0      C

### Transform Application Record DataFrame

### Transform Credit Record DataFram

### Create Database Connection

In [4]:
protocol = 'postgresql'
username = 'postgres'
password = 'postgres'
host = 'localhost'
port = 5432
database_name = 'creditcard_db'
rds_connection_string = f'{protocol}://{username}:{password}@{host}:{port}/{database_name}'
engine = create_engine(rds_connection_string)
insp = inspect(engine)

In [5]:
# Confirm tables
insp.get_table_names()

['credit_record', 'application_record']

### Load DataFrames into database

In [6]:
application_df.to_sql(name='application_record', con=engine, if_exists='append', index=False)

NameError: name 'application_df' is not defined

In [ ]:
credit_df.to_sql(name='credit_record', con=engine, if_exists='append', index=False)

### Test database with SQL query

In [ ]:
pd.read_sql_query('SELECT * from application_record LIMIT 100', con=engine).head()